---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.CurrentObject
source: html/2d42735a-7e29-66a9-41b3-87ad317e1135.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```